Poiseuille/system/probes
// -*- C++ -*-

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (U);
probeLocations
(
    (1 0.5 0)
);


// ************************************************************************* //
